RedditClone/app/controllers/users_controller.rb

SELECT "users".* FROM "users"
---
    def index
        @user = User.all

INSERT INTO "users" ("username", "session_token", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["username", "Flotsam"], ["session_token", "[FILTERED]"], ["password_digest", "[FILTERED]"], ["created_at", "2023-03-15 01:36:08.401527"], ["updated_at", "2023-03-15 01:36:08.401527"]]
---
    def create
        @user = User.new(user_params)
        if @user.save!