RedditClone/app/models/user.rb

    def self.find_by_credentials(username, password)
        @user = User.find_by(username: username)
---
SELECT "users".* FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", "Flotsam"], ["LIMIT", 1]]

    def reset_session_token!
        self.session_token = generate_session_token
        self.save!
---
UPDATE "users" SET "session_token" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["session_token", "[FILTERED]"], ["updated_at", "2023-03-15 01:37:51.720827"], ["id", 2]]

        def generate_session_token
            session_token = SecureRandom::urlsafe_base64
            while User.exists?(session_token: session_token)
---
SELECT 1 AS one FROM "users" WHERE "users"."session_token" = ? LIMIT ?  [["session_token", "[FILTERED]"], ["LIMIT", 1]]